#include <stdio.h>
//例：12321，首先遍历长度为5，取第一个模1乘以10的长度减1次方即10的4次方，得10000，
//再加上第二个模2乘以10的长度减2次方，得12000，
//以此类推，得到12321，再与原来的数相比较，相同即为对称数。
int main(){
    int i,j=0,k,l=0,m=1,n=0,o;
    scanf("%d",&i);
    o=i;
    while(i){
        i/=10;
        l++;
    }
    l--;
    i=o;
    while(i){
        k=i%10;
        i/=10;
        n=l;
        while(l>0){
            m*=10;
            l--;
        }
        j+=k*m;
        m=1;
        n--;
        l=n;
    }
    if(o==j){
        printf("%d是对称数！",o);
    }
    else{
        printf("%d不是对称数！",o);
    }
}